In [33]:
import pandas as pd
from pandas import Series, DataFrame

# Series
n: int = 1000
sample_pandas_data  = pd.Series([i * 10 for i in range(n)])
sample_pandas_data

0         0
1        10
2        20
3        30
4        40
       ...
995    9950
996    9960
997    9970
998    9980
999    9990
Length: 1000, dtype: int64

In [7]:
sample_pandas_data_with_index = pd.DataFrame([i * 10 for i  in range(10)], index=["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"])
print(sample_pandas_data_with_index)

    0
a   0
b  10
c  20
d  30
e  40
f  50
g  60
h  70
i  80
j  90

In [8]:
print(sample_pandas_data_with_index.values)
print(sample_pandas_data_with_index.index)

[[ 0]
 [10]
 [20]
 [30]
 [40]
 [50]
 [60]
 [70]
 [80]
 [90]]
Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [10]:
attri_data = {'ID': ['100', '101', '102', '103', '104'],
                        'City': ['Tokyo', 'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
                         'Birth_year':[1990, 1989, 1992, 1997, 1982]}
attri_data_frame1 = DataFrame(attri_data)
print(attri_data_frame1)

    ID      City  Birth_year
0  100     Tokyo        1990
1  101     Osaka        1989
2  102     Kyoto        1992
3  103  Hokkaido        1997
4  104     Tokyo        1982

In [11]:
attri_data_frame_index1 = DataFrame(attri_data, index=['a', 'b', 'c', 'd', 'e'])
print(attri_data_frame_index1)

    ID      City  Birth_year
a  100     Tokyo        1990
b  101     Osaka        1989
c  102     Kyoto        1992
d  103  Hokkaido        1997
e  104     Tokyo        1982

In [12]:
attri_data_frame_index1

    ID      City  Birth_year
a  100     Tokyo        1990
b  101     Osaka        1989
c  102     Kyoto        1992
d  103  Hokkaido        1997
e  104     Tokyo        1982

In [15]:
# Filter
attri_data_frame1[attri_data_frame1['City'] == 'Tokyo']

    ID   City  Birth_year
0  100  Tokyo        1990
4  104  Tokyo        1982

In [16]:
attri_data_frame1[attri_data_frame1['City'].isin(['Tokyo', 'Osaka'])]

    ID   City  Birth_year
0  100  Tokyo        1990
1  101  Osaka        1989
4  104  Tokyo        1982

In [18]:
attri_data_frame1[attri_data_frame1['Birth_year'] <= 1990]

    ID   City  Birth_year
0  100  Tokyo        1990
1  101  Osaka        1989
4  104  Tokyo        1982

In [19]:
attri_data_frame1.drop(['Birth_year'], axis=1)

    ID      City
0  100     Tokyo
1  101     Osaka
2  102     Kyoto
3  103  Hokkaido
4  104     Tokyo

In [20]:
attri_data_frame1

    ID      City  Birth_year
0  100     Tokyo        1990
1  101     Osaka        1989
2  102     Kyoto        1992
3  103  Hokkaido        1997
4  104     Tokyo        1982

In [21]:
attri_data2 = {'ID': ['100', '101', '102', '103', '104'],
                          'Math': [50,43,33,76,98],
                          'English': [90,30,20,50,30],
                          'Sex': ['M', 'F', 'F','M','M']}
attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  103    76       50   M
4  104    98       30   M

In [22]:
pd.merge(attri_data_frame1, attri_data_frame2)

    ID      City  Birth_year  Math  English Sex
0  100     Tokyo        1990    50       90   M
1  101     Osaka        1989    43       30   F
2  102     Kyoto        1992    33       20   F
3  103  Hokkaido        1997    76       50   M
4  104     Tokyo        1982    98       30   M

In [23]:
# Summary
attri_data_frame2.groupby('Sex')['Math'].mean()

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

In [24]:
# Data Preparation
attri_data3 = {'ID': ['100', '101', '102', '103', '104'],
                         'City': ['Tokyo', 'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
                         'Birth_year': [1990, 1989, 1992, 1997, 1982],
                          'Name':  ['Suzu', 'Haruka', 'Tao', 'Aya', 'Yuko']}
attri_data_frame3 = DataFrame(attri_data3)
attri_data_frame3

    ID      City  Birth_year    Name
0  100     Tokyo        1990    Suzu
1  101     Osaka        1989  Haruka
2  102     Kyoto        1992     Tao
3  103  Hokkaido        1997     Aya
4  104     Tokyo        1982    Yuko

In [27]:
attri_data_frame3.Birth_year.sort_values()

4    1982
1    1989
0    1990
2    1992
3    1997
Name: Birth_year, dtype: int64

In [28]:
attri_data_frame3.isin(['Tokyo'])

      ID   City  Birth_year   Name
0  False   True       False  False
1  False  False       False  False
2  False  False       False  False
3  False  False       False  False
4  False   True       False  False

In [30]:
# nan, null
import numpy as np
attri_data_frame3['Name'] = np.nan
attri_data_frame3.isnull()

      ID   City  Birth_year  Name
0  False  False       False  True
1  False  False       False  True
2  False  False       False  True
3  False  False       False  True
4  False  False       False  True

In [31]:
attri_data_frame3.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64